{
    "class_name": "Model",
    "config": {
        "name": "decoder_model",
        "layers": [
            {
                "name": "input_4",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        16
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_4"
                },
                "inbound_nodes": []
            },
            {
                "name": "dense_6",
                "class_name": "Dense",
                "config": {
                    "name": "dense_6",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20480,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "p_re_lu_5",
                "class_name": "PReLU",
                "config": {
                    "name": "p_re_lu_5",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "alpha_regularizer": null,
                    "alpha_constraint": null,
                    "shared_axes": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "reshape_1",
                "class_name": "Reshape",
                "config": {
                    "name": "reshape_1",
                    "trainable": true,
                    "dtype": "float32",
                    "target_shape": [
                        64,
                        64,
                        5
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "p_re_lu_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_transpose_1",
                "class_name": "Conv2DTranspose",
                "config": {
                    "name": "conv2d_transpose_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 64,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "output_padding": null
                },
                "inbound_nodes": [
                    [
                        [
                            "reshape_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "p_re_lu_6",
                "class_name": "PReLU",
                "config": {
                    "name": "p_re_lu_6",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "alpha_regularizer": null,
                    "alpha_constraint": null,
                    "shared_axes": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_transpose_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_transpose_2",
                "class_name": "Conv2DTranspose",
                "config": {
                    "name": "conv2d_transpose_2",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 32,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "output_padding": null
                },
                "inbound_nodes": [
                    [
                        [
                            "p_re_lu_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "p_re_lu_7",
                "class_name": "PReLU",
                "config": {
                    "name": "p_re_lu_7",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "alpha_regularizer": null,
                    "alpha_constraint": null,
                    "shared_axes": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_transpose_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_transpose_3",
                "class_name": "Conv2DTranspose",
                "config": {
                    "name": "conv2d_transpose_3",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 16,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "output_padding": null
                },
                "inbound_nodes": [
                    [
                        [
                            "p_re_lu_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "p_re_lu_8",
                "class_name": "PReLU",
                "config": {
                    "name": "p_re_lu_8",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "alpha_regularizer": null,
                    "alpha_constraint": null,
                    "shared_axes": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_transpose_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_transpose_4",
                "class_name": "Conv2DTranspose",
                "config": {
                    "name": "conv2d_transpose_4",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "output_padding": null
                },
                "inbound_nodes": [
                    [
                        [
                            "p_re_lu_8",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "p_re_lu_9",
                "class_name": "PReLU",
                "config": {
                    "name": "p_re_lu_9",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "alpha_regularizer": null,
                    "alpha_constraint": null,
                    "shared_axes": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_transpose_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_transpose_5",
                "class_name": "Conv2DTranspose",
                "config": {
                    "name": "conv2d_transpose_5",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 5,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "tanh",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null,
                    "output_padding": null
                },
                "inbound_nodes": [
                    [
                        [
                            "p_re_lu_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "out_recon",
                "class_name": "Reshape",
                "config": {
                    "name": "out_recon",
                    "trainable": true,
                    "dtype": "float32",
                    "target_shape": [
                        64,
                        64,
                        5
                    ]
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_transpose_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_4",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "out_recon",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.3.1",
    "backend": "tensorflow"
}