{
    "class_name": "Model",
    "config": {
        "name": "model_2",
        "layers": [
            {
                "name": "input_1",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        64,
                        64,
                        5
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_1"
                },
                "inbound_nodes": []
            },
            {
                "name": "conv2d_1",
                "class_name": "Conv2D",
                "config": {
                    "name": "conv2d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "filters": 128,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "batch_normalization_1",
                "class_name": "BatchNormalization",
                "config": {
                    "name": "batch_normalization_1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -1,
                    "momentum": 0.99,
                    "epsilon": 0.001,
                    "center": true,
                    "scale": true,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "moving_mean_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "moving_variance_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "convert_to_caps_1",
                "class_name": "ConvertToCaps",
                "config": {
                    "name": "convert_to_caps_1",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "batch_normalization_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_1",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_1",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 4,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "convert_to_caps_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_3",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_3",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 4,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_4",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_4",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 4,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_2",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_2",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 4,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "add_1",
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_4",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_caps_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_5",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_5",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_7",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_7",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_8",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_8",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_7",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_6",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_6",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_5",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "add_2",
                "class_name": "Add",
                "config": {
                    "name": "add_2",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_8",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_caps_6",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_9",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_9",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "add_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_11",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_11",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_12",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_12",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_11",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_10",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_10",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_9",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "add_3",
                "class_name": "Add",
                "config": {
                    "name": "add_3",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_12",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv2d_caps_10",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_13",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_13",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        2,
                        2
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "add_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_14",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_14",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_13",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv2d_caps_15",
                "class_name": "Conv2DCaps",
                "config": {
                    "name": "conv2d_caps_15",
                    "trainable": true,
                    "dtype": "float32",
                    "ch_j": 32,
                    "n_j": 8,
                    "kernel_size": [
                        3,
                        3
                    ],
                    "strides": [
                        1,
                        1
                    ],
                    "b_alphas": [
                        1,
                        1,
                        1
                    ],
                    "padding": "same",
                    "data_format": "channels_last",
                    "dilation_rate": [
                        1,
                        1
                    ],
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "kernel_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_14",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "conv_capsule_layer3d_1",
                "class_name": "ConvCapsuleLayer3D",
                "config": {
                    "name": "conv_capsule_layer3d_1",
                    "trainable": true,
                    "dtype": "float32",
                    "kernel_size": 3,
                    "num_capsule": 32,
                    "num_atoms": 8,
                    "strides": 1,
                    "padding": "same",
                    "routings": 3,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    }
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_13",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "add_4",
                "class_name": "Add",
                "config": {
                    "name": "add_4",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "conv2d_caps_15",
                            0,
                            0,
                            {}
                        ],
                        [
                            "conv_capsule_layer3d_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "flatten_caps_1",
                "class_name": "FlattenCaps",
                "config": {
                    "name": "flatten_caps_1",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "add_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "flatten_caps_2",
                "class_name": "FlattenCaps",
                "config": {
                    "name": "flatten_caps_2",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "add_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "concatenate_1",
                "class_name": "Concatenate",
                "config": {
                    "name": "concatenate_1",
                    "trainable": true,
                    "dtype": "float32",
                    "axis": -2
                },
                "inbound_nodes": [
                    [
                        [
                            "flatten_caps_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "flatten_caps_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "digit_caps",
                "class_name": "CapsuleLayer",
                "config": {
                    "name": "digit_caps",
                    "trainable": true,
                    "dtype": "float32",
                    "num_capsule": 2,
                    "dim_capsule": 16,
                    "channels": 0
                },
                "inbound_nodes": [
                    [
                        [
                            "concatenate_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "mask_cid_2",
                "class_name": "Mask_CID",
                "config": {
                    "name": "mask_cid_2",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "digit_caps",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "capsnet",
                "class_name": "CapsToScalars",
                "config": {
                    "name": "capsnet",
                    "trainable": true,
                    "dtype": "float32"
                },
                "inbound_nodes": [
                    [
                        [
                            "digit_caps",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "decoder_model",
                "class_name": "Model",
                "config": {
                    "name": "decoder_model",
                    "layers": [
                        {
                            "name": "input_4",
                            "class_name": "InputLayer",
                            "config": {
                                "batch_input_shape": [
                                    null,
                                    16
                                ],
                                "dtype": "float32",
                                "sparse": false,
                                "name": "input_4"
                            },
                            "inbound_nodes": []
                        },
                        {
                            "name": "dense_6",
                            "class_name": "Dense",
                            "config": {
                                "name": "dense_6",
                                "trainable": true,
                                "dtype": "float32",
                                "units": 20480,
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                        "scale": 2.0,
                                        "mode": "fan_in",
                                        "distribution": "normal",
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null
                            },
                            "inbound_nodes": [
                                [
                                    [
                                        "input_4",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "name": "p_re_lu_5",
                            "class_name": "PReLU",
                            "config": {
                                "name": "p_re_lu_5",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "alpha_regularizer": null,
                                "alpha_constraint": null,
                                "shared_axes": null
                            },
                            "inbound_nodes": [
                                [
                                    [
                                        "dense_6",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "name": "reshape_1",
                            "class_name": "Reshape",
                            "config": {
                                "name": "reshape_1",
                                "trainable": true,
                                "dtype": "float32",
                                "target_shape": [
                                    64,
                                    64,
                                    5
                                ]
                            },
                            "inbound_nodes": [
                                [
                                    [
                                        "p_re_lu_5",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "name": "conv2d_transpose_1",
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_1",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 64,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                        "scale": 2.0,
                                        "mode": "fan_in",
                                        "distribution": "normal",
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            },
                            "inbound_nodes": [
                                [
                                    [
                                        "reshape_1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "name": "p_re_lu_6",
                            "class_name": "PReLU",
                            "config": {
                                "name": "p_re_lu_6",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "alpha_regularizer": null,
                                "alpha_constraint": null,
                                "shared_axes": null
                            },
                            "inbound_nodes": [
                                [
                                    [
                                        "conv2d_transpose_1",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "name": "conv2d_transpose_2",
                            "class_name": "Conv2DTranspose",
                            "config": {
                                "name": "conv2d_transpose_2",
                                "trainable": true,
                                "dtype": "float32",
                                "filters": 32,
                                "kernel_size": [
                                    3,
                                    3
                                ],
                                "strides": [
                                    1,
                                    1
                                ],
                                "padding": "same",
                                "data_format": "channels_last",
                                "dilation_rate": [
                                    1,
                                    1
                                ],
                                "activation": "linear",
                                "use_bias": true,
                                "kernel_initializer": {
                                    "class_name": "VarianceScaling",
                                    "config": {
                                        "scale": 2.0,
                                        "mode": "fan_in",
                                        "distribution": "normal",
                                        "seed": null
                                    }
                                },
                                "bias_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "kernel_regularizer": null,
                                "bias_regularizer": null,
                                "activity_regularizer": null,
                                "kernel_constraint": null,
                                "bias_constraint": null,
                                "output_padding": null
                            },
                            "inbound_nodes": [
                                [
                                    [
                                        "p_re_lu_6",
                                        0,
                                        0,
                                        {}
                                    ]
                                ]
                            ]
                        },
                        {
                            "name": "p_re_lu_7",
                            "class_name": "PReLU",
                            "config": {
                                "name": "p_re_lu_7",
                                "trainable": true,
                                "dtype": "float32",
                                "alpha_initializer": {
                                    "class_name": "Zeros",
                                    "config": {}
                                },
                                "alpha_regularizer": null,
                                "alpha_constraint": null,
