{
    "class_name": "Model",
    "config": {
        "name": "redshift_model",
        "layers": [
            {
                "name": "input_3",
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        16
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_3"
                },
                "inbound_nodes": []
            },
            {
                "name": "dense_1",
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 128,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "input_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "p_re_lu_1",
                "class_name": "PReLU",
                "config": {
                    "name": "p_re_lu_1",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "alpha_regularizer": null,
                    "alpha_constraint": null,
                    "shared_axes": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_2",
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 64,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "p_re_lu_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "p_re_lu_2",
                "class_name": "PReLU",
                "config": {
                    "name": "p_re_lu_2",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "alpha_regularizer": null,
                    "alpha_constraint": null,
                    "shared_axes": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_3",
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 32,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "p_re_lu_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "p_re_lu_3",
                "class_name": "PReLU",
                "config": {
                    "name": "p_re_lu_3",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "alpha_regularizer": null,
                    "alpha_constraint": null,
                    "shared_axes": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_4",
                "class_name": "Dense",
                "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 16,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "p_re_lu_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "p_re_lu_4",
                "class_name": "PReLU",
                "config": {
                    "name": "p_re_lu_4",
                    "trainable": true,
                    "dtype": "float32",
                    "alpha_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "alpha_regularizer": null,
                    "alpha_constraint": null,
                    "shared_axes": null
                },
                "inbound_nodes": [
                    [
                        [
                            "dense_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "name": "dense_5",
                "class_name": "Dense",
                "config": {
                    "name": "dense_5",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 1.0,
                            "mode": "fan_avg",
                            "distribution": "uniform",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "inbound_nodes": [
                    [
                        [
                            "p_re_lu_4",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": [
            [
                "input_3",
                0,
                0
            ]
        ],
        "output_layers": [
            [
                "dense_5",
                0,
                0
            ]
        ]
    },
    "keras_version": "2.3.1",
    "backend": "tensorflow"
}